; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;; Reference paper: Scala, Enrico, Patrik Haslum, Sylvie Thiébaux, and Miquel Ramirez. 
;;                  "Subgoaling techniques for satisficing and optimal numeric planning." 
;;                  Journal of Artificial Intelligence Research 68 (2020): 691-752.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; The Farmland domain models allocating manpower to farms, with a 
;; hard constraint on a metric measuring benefit. The contribution of
;; each farm to the benefit is a function of the number of workers assigned
;; Each farm requires at least one worker
(define (domain farmland)
    (:types farm - object)
    (:predicates (adj ?f1 ?f2 - farm))
    (:functions
        (x ?b - farm)
        (cost)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action move-fast
        :parameters (?f1 ?f2 - farm)
       :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 4) (adj ?f1 ?f2) )
      :effect (and(decrease (x ?f1) 4) (increase (x ?f2) 2) (increase (cost) 1))
    )
    
    (:action move-slow
         :parameters (?f1 ?f2 - farm)
         :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 1) (adj ?f1 ?f2))
         :effect (and(decrease (x ?f1) 1) (increase (x ?f2) 1))
    )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_4_16)
	(:domain farmland)
	(:objects
		farm0  farm1  farm2  farm3  - farm
	)
  (:init
        (= (cost) 0)
		(= (x farm0) 0)
		(= (x farm1) 0)
		(= (x farm2) 0)
		(= (x farm3) 16)
		
		(adj farm0 farm1)
		(adj farm0 farm2)
		(adj farm0 farm3)
		(adj farm1 farm0)
		(adj farm2 farm0)
		(adj farm3 farm0)
		
	)
	(:goal
		(and
			(>= (x farm0) 1)
			(>= (x farm1) 1)
			(>= (x farm2) 1)
			(>= (x farm3) 1)
			
			(>= (+ (* 2.0 (x farm0))(+ (* 1.9 (x farm1))(+ (* 1.6 (x farm2))(+ (* 1.0 (x farm3)) 0)))) 22.4)
		)
	)
)

; plan
1. (move-slow farm3 farm0)
   changed: (x farm3) from 16 to 15, (x farm0) from 0 to 1
   goals met: 2 of 5
2. (move-slow farm3 farm0)
   changed: (x farm3) from 15 to 14, (x farm0) from 1 to 2
   goals met: 2 of 5
3. (move-slow farm3 farm0)
   changed: (x farm3) from 14 to 13, (x farm0) from 2 to 3
   goals met: 2 of 5
4. (move-slow farm3 farm0)
   changed: (x farm3) from 13 to 12, (x farm0) from 3 to 4
   goals met: 2 of 5
5. (move-slow farm3 farm0)
   changed: (x farm3) from 12 to 11, (x farm0) from 4 to 5
   goals met: 2 of 5
6. (move-slow farm3 farm0)
   changed: (x farm3) from 11 to 10, (x farm0) from 5 to 6
   goals met: 2 of 5
7. (move-slow farm3 farm0)
   changed: (x farm3) from 10 to 9, (x farm0) from 6 to 7
   goals met: 3 of 5
8. (move-slow farm0 farm1)
   changed: (x farm0) from 7 to 6, (x farm1) from 0 to 1
   goals met: 4 of 5
9. (move-slow farm0 farm2)
   changed: (x farm0) from 6 to 5, (x farm2) from 0 to 1
   goals met: 5 of 5
